Repository: theanhtr/BT_Khoi_Customize_BE
Catalog: MISA.WebFresher052023.CTM/MISA.WebFresher052023.CTM.Domain/Resource/Resource.*.resx
Languages: vi

# Code_Exist
source: The <{0}> object already exists in the system.
vi: Đối tượng <{0}> đã tồn tại trong hệ thống.

# Code_Not_Exist
source: The <{0}> object does not exist in the system.
vi: Đối tượng <{0}> không tồn tại trong hệ thống.

# Delete_Empty_Error
source: Cannot delete from an empty list!
vi: Không thể xóa từ danh sách rỗng!

# Department_Exist
source: The department <{0}> already exists in the system.
vi: Phòng ban <{0}> đã tồn tại trong hệ thống.

# Department_Not_Exist
source: The department <{0}> does not exist in the system.
vi: Phòng ban <{0}> không tồn tại trong hệ thống.

# Employee_Basic_Excel_Template_File_Name
source: Employee_Basic_Template.xlsx
vi: Mau_danh_muc_nhan_vien.xlsx

# Employee_Excel_Export_File_Name
source: Employee_List.xlsx
vi: Danh_sach_nhan_vien.xlsx

# Employee_Exist
source: The employee <{0}> already exists in the system.
vi: Nhân viên <{0}> đã tồn tại trong hệ thống.

# Employee_Full_Excel_Template_File_Name
source: Employee_Full_Template.xlsx
vi: Mau_danh_muc_nhan_vien_full.xlsx

# Employee_Not_Exist
source: The employee <{0}> does not exist in the system.
vi: Nhân viên <{0}> không tồn tại trong hệ thống.

# Excel_Employee_Code_Header_Name
source: Employee Code
vi: Mã nhân viên

# Excel_Employee_Title_Export
source: Employee List
vi: Danh sách nhân viên

# Excel_Header_Duplicate
source: The header <{0}> is duplicated.
vi: Tiêu đề <{0}> đã bị trùng.

# Excel_Header_Empty
source: The header name cannot be empty.
vi: Tên tiêu đề không được để trống.

# Excel_Header_Required_Not_Map
source: Cannot proceed with data import if required columns are not mapped to corresponding columns in the Excel file. Please check again.
vi: Không thể tiếp tục nhập dữ liệu nếu các cột bắt buộc chưa được ghép với cột tương ứng trên tệp Excel. Vui lòng kiểm tra lại.

# Excel_Row_Duplicate
source: Data row is a duplicate of row number <{0}>.
vi: Dòng dữ liệu trùng với dòng số <{0}>.

# Exception_NotFound_Default
source: Resource not found.
vi: Không tìm thấy tài nguyên.

# Exception_System_Default
source: System error, please contact MISA for assistance.
vi: Lỗi hệ thống, vui lòng liên hệ MISA để được trợ giúp.

# Exception_Validate_Default
source: Invalid data, please check again.
vi: Dữ liệu không hợp lệ, vui lòng kiểm tra lại.

# Format_Excel_Error
source: Invalid attachment file, only .xlsx files are allowed.
vi: Tệp đính kèm không hợp lệ, chỉ chấp file .xlsx.

# Gender_Female
source: Female
vi: Nữ

# Gender_Male
source: Male
vi: Nam

# Gender_Other
source: Other
vi: Khác

# Import_Excel_Request_Success
source: The system has recorded the import command.
vi: Hệ thống đã ghi nhận lệnh nhập khẩu.

# Lang_Code
source: en
vi: vi

# Max_Size_File_Error
source: Exceeded the allowed file size.
vi: Vượt quá kích thước file cho phép.

# Session_Is_Over
source: Your session has expired, please reload the page to start a new session.
vi: Phiên làm việc của bạn đã hết, vui lòng reload trang để bắt đầu phiên mới.

# Sheet_Is_Empty
source: The sheet has no data.
vi: Sheet không có dữ liệu.

# Validate_ThreadName_NotNull
source: The full name must not be empty.
vi: Họ tên không được phép để trống.

# Validate_User_Input_Error
source: User input error.
vi: Lỗi nhập liệu từ người dùng.

# Wrong_Format_Code
source: Code <{0}> has an incorrect format. The correct format is: NV-1001, AB2-999.
vi: Code <{0}> không đúng định dạng. Ví dụ đúng: NV-1001, AB2-999.

# Wrong_Format_Date
source: Incorrect date format, the correct format is: <{0}>.
vi: Sai định dạng ngày tháng, định dạng đúng: <{0}>.

# Wrong_Format_Email
source: Invalid email format.
vi: Email không đúng định dạng.

# Wrong_Length
source: <{0}> has a length greater than {1} characters.
vi: <{0}> có độ dài lớn hơn {1} ký tự.
